In [13]:
import pandas as pd
import numpy as np

def count_unique_values(df):
    # Create a new column to store the counts
    df['unique_count'] = 0

    # Iterate over each row in the DataFrame
    for index, row in df.iterrows():
        # Create a set to store unique non-blank values
        unique_values = set()

        # Iterate over the columns add1, add2, add3, add4, add5
        for col in ['add1', 'add2', 'add3', 'add4', 'add5']:
            # Get the value in the current column
            value = row[col]

            # Check if the value is non-blank
            if pd.notnull(value) and value != '':
                # Add the non-blank value to the set
                unique_values.add(value)

        # Update the 'unique_count' column with the count of unique non-blank values
        df.at[index, 'unique_count'] = len(unique_values)

    return df

In [5]:
# Create a sample DataFrame
data = {
    'id': [1, 2, 3],
    'add1': ['A', 'B', ''],
    'add2': ['C', 'I', 'D'],
    'add3': ['A', '', 'F'],
    'add4': ['G', 'I', 'H'],
    'add5': ['', 'I', 'J']
}

df = pd.DataFrame(data)

# Call the function to count unique values
df = count_unique_values(df)

# Print the updated DataFrame
print(df)

   id add1 add2 add3 add4 add5  unique_count
0   1    A    C    A    G                  3
1   2    B    I         I    I             2
2   3         D    F    H    J             4

In [6]:
df[['add1', 'add2', 'add3', 'add4', 'add5']].notna().sum().sum()

15

In [16]:
df['not_null_count'] = df[['add1', 'add2', 'add3', 'add4', 'add5']].replace("",np.nan).notnull().sum(axis=1)

In [15]:
df

   id add1 add2 add3 add4 add5  unique_count  not_null_count
0   1    A    C    A    G                  3               4
1   2    B    I         I    I             2               4
2   3         D    F    H    J             4               4

In [18]:
df

   id add1 add2 add3 add4 add5  unique_count  not_null_count
0   1    A    C    A    G                  3               4
1   2    B    I         I    I             2               4
2   3         D    F    H    J             4               4